(****************************************************************************** 
  Шаблон для выполнения заданий лабораторной работы №1

  НЕ СЛЕДУЕТ УДАЛЯТЬ ИЛИ ПЕРЕСТАВЛЯТЬ МЕСТАМИ ЭЛЕМЕНТЫ, 
  ПРЕДСТАВЛЕННЫЕ В ШАБЛОНЕ (ВКЛЮЧАЯ КОММЕНТАРИИ). 
  ЭЛЕМЕНТЫ РЕШЕНИЯ СЛЕДУЕТ ВПИСЫВАТЬ В ПРОМЕЖУТКИ,
  ОПРЕДЕЛЕННЫЕ КОММЕНТАРИЯМИ.
 ******************************************************************************)

(****************************************************************************** 
  Загрузка определений модулей MyDate и Fixed и вспомогательных списков данных 
 ******************************************************************************)
use "lab-1-use.sml";

(****************************************************************************** 
  Задание 1 isLeapYear
 ******************************************************************************)
fun isLeapYear (year : int, isJulian : bool) : bool =
  if isJulian then year mod 4 = 0
  else year mod 400 = 0
  orelse year mod 100 <> 0 andalso year mod 4 = 0

(******************************************************************************)

(****************************************************************************** 
  Задание 2 isLongMonth
 ******************************************************************************)
fun isLongMonth (month : int) : bool =
  if month < 8 then (month + 1) mod 2 = 0
  else month mod 2 = 0

(******************************************************************************)

(****************************************************************************** 
  Задание 3 daysInMonth
 ******************************************************************************)
fun daysInMonth (d : date, isJulian : bool) : int =
  if (#2 d = 2 andalso isLeapYear (#3 d, isJulian)) 
  then 29
  else if #2 d = 2 
       then 28
       else if isLongMonth (#2 d)
            then 31
            else 30

(******************************************************************************)

(****************************************************************************** 
  Задание 4 isDayOK
 ******************************************************************************)
fun isDayOK (d : date, isJulian : bool) : bool =
  not (#1 d < 1 orelse #1 d > daysInMonth (d, isJulian))

(******************************************************************************)

(****************************************************************************** 
  Задание 5 isMonthOK
 ******************************************************************************)
fun isMonthOK (d : date) : bool =
  not (#2 d < 1 orelse #2 d > 12)

(******************************************************************************)

(****************************************************************************** 
  Задание 6 isCorrectDate
 ******************************************************************************)
fun isCorrectDate (d : date, isJulian : bool) : bool =
  isDayOK (d, isJulian) andalso isMonthOK d
(******************************************************************************)

(****************************************************************************** 
  Задание 7 incDateByNum
 ******************************************************************************)
fun incDateByNum (d : date, days : int, isJulian : bool) : date =
  let
    val day = #1 d
    val dayPlusDays = day + days
  in
    if dayPlusDays <= daysInMonth (d, isJulian)
    then MyDate.anotherDay (d, dayPlusDays) 
    else 
      let
        val month = #2 d
        val year = #3 d
        val newDays = days - daysInMonth (d, isJulian) + day - 1
      in
        if month < 12 then
          incDateByNum( (1, month + 1, year), newDays, isJulian)
        else incDateByNum( (1, 1, year + 1), newDays, isJulian)
      end
  end


(******************************************************************************)

(****************************************************************************** 
  Задание 8 decDateByNum
 ******************************************************************************)
fun decDateByNum (d : date, daysMinus : int, isJulian : bool) : date =
  let
    val day = #1 d
    val daysDiff = day - daysMinus
  in
    if daysDiff > 0 then 
      MyDate.anotherDay (d, daysDiff) 
    else
      let
        val year = #3 d
        val daysMinusDay = daysMinus - day
        val monthMinus1 = #2 d - 1
      in
        if monthMinus1 + 1 > 1 then 
          decDateByNum ( (daysInMonth ((day, monthMinus1, year), isJulian)
                         , monthMinus1, year
                         )
                       , daysMinusDay, isJulian
                       )
        else decDateByNum ( (31, 12, year - 1), daysMinusDay, isJulian)
      end
  end

(******************************************************************************)

(****************************************************************************** 
  Задание 9 newStyleCorrection
 ******************************************************************************)
fun newStyleCorrection (date : date) : int =
  let
    val year = #3 date
    val month = #2 date
    val century = year div 100
    val daysDiff = century - century div 4 - 2
  in
      if year mod 100 > 0 orelse month > 2 orelse month = 2
                          andalso #1 date = 29
    then daysDiff
    else daysDiff - 1
  end

(******************************************************************************)

(****************************************************************************** 
  Задание 10 toJulianDay
 ******************************************************************************)
fun toJulianDay (grigDate : date) : date =
  decDateByNum (grigDate, newStyleCorrection (grigDate), false)

(******************************************************************************)

(****************************************************************************** 
  Задание 11 toGrigorianDay
 ******************************************************************************)
fun toGrigorianDay (julianDate : date) : date =
  incDateByNum (julianDate, newStyleCorrection (julianDate), true)

(******************************************************************************)

(****************************************************************************** 
  Задание 12 younger
 ******************************************************************************)
fun younger (date1 : date, date2 : date) : bool =
  let
    val y1 = #3 date1
    val y2 = #3 date2
    val m1 = #2 date1
    val m2 = #2 date2
  in
    if y1 <> y2      then y1 > y2
    else if m1 <> m2 then m1 > m2
    else #1 date1 > #1 date2
  end

(******************************************************************************)

(****************************************************************************** 
  Задание 13 youngest
 ******************************************************************************)
(*fun youngest (l : (string * date) list) : date =
  if null l then NONE
  else
    let
      val head = #2 (hd l)
      val newHead = #2 (hd (tl l))
    in
      if younger (head, newHead) then head
      else youngest (tl l)
    end*)

(******************************************************************************)

(****************************************************************************** 
  Задание 14 getNthFixed
 ******************************************************************************)
fun getNthFixed (values : int * fixed list) : fixed =
  let val n = #1 values
      val l = #2 values
  in
    if n = 0 then hd (l) else getNthFixed (n - 1, tl l)
  end
(******************************************************************************)

(****************************************************************************** 
  Задание 15 numToDigits
 ******************************************************************************)
fun numToDigits (ntg : int * int) : int list =
  let
    val secondValue = #2 ntg
  in
    if secondValue = 0 then []
    else 
      let val firstValue = #1 ntg
          val secValMinus1 = secondValue - 1
      in
        if firstValue = 0 then
          0 :: numToDigits (0, secValMinus1)
        else
          (firstValue mod 10) :: numToDigits (firstValue div 10
                                             , secValMinus1
                                             )
      end
  end

(******************************************************************************)

(****************************************************************************** 
  Задание 16 listElements
 ******************************************************************************)
fun listElements (dl : int list * fixed list list) : fixed list =
  let val firstL = #1 dl
  in
    if firstL = [] then []
    else
      let val secL = #2 dl
      in
        getNthFixed (hd (firstL), hd (secL)) 
        :: listElements (tl (firstL), tl (secL))
      end
  end
(******************************************************************************)

(****************************************************************************** 
  Задание 17 listSum
 ******************************************************************************)
fun listSum (fl : fixed list) : fixed =
  if null fl then 0
  else hd fl + listSum (tl fl)

(******************************************************************************)

(****************************************************************************** 
  Задание 18 maxSmaller
 ******************************************************************************)
fun maxSmaller (l : fixed list * fixed) : fixed = 
  if null (#1 l) then 0
  else 
    let
      val amount = #2 l
      val listWithElements = #1 l
      val maxTail = maxSmaller (tl (listWithElements), amount)
      val head = hd (listWithElements)
    in
      if head < amount then
        if head > maxTail then head else maxTail
      else
        maxTail
    end

(******************************************************************************)

(****************************************************************************** 
  Задание 19 dateToCorrectionNums
 ******************************************************************************)
fun dateToCorrectionNums (d : date) : int list =
  #2 d - 1 :: numToDigits (#3 d, 4) @ [#3 d mod 4]

(******************************************************************************)

(****************************************************************************** 
  Задание 20 firstNewMoon
 ******************************************************************************)
fun firstNewMoon (actDate : date) : (fixed * date) option =
  let
    val d = #1 actDate
    val m = #2 actDate
    val y = #3 actDate
    fun checkMonth (m : int, y : int) = if m < 3 then y - 1 else y
    val correctionNums = dateToCorrectionNums (d, m, checkMonth(m, y))
    val summ = listSum (listElements (correctionNums, corrections))
    val diff = Fixed.fromInt (newStyleCorrection actDate)
    val totalSum = diff + summ
    val reduction = maxSmaller (reductions, totalSum - Fixed.fromInt 1)
    val fnum = if reduction = 0 then totalSum else totalSum - reduction
    val newDate = (Fixed.toInt fnum, m, y)
  in
    if isCorrectDate (newDate, false)
    then SOME (fnum, newDate)
    else NONE
  end

(******************************************************************************)

(****************************************************************************** 
  Задание 21 winterSolstice
 ******************************************************************************)
fun winterSolstice (year : int) : date =
  let
    val totalDays = 2250000 + 24220 * year - 100000 
                    * (year div 4 - year div 100 + year div 400)
  in
    (Fixed.toInt totalDays, 12, year)
  end

(******************************************************************************)

(****************************************************************************** 
  Задание 22 chineseNewYearDate
 ******************************************************************************)


(******************************************************************************)

(****************************************************************************** 
  Задание 23 getNthString
 ******************************************************************************)
fun getNthString (strs : int * string list) : string =
  let val n = #1 strs
      val l = #2 strs
  in
    if n = 0 then hd (l) else getNthString (n - 1, tl l)
  end

(******************************************************************************)

(****************************************************************************** 
  Задание 24 dateToString
 ******************************************************************************)
fun dateToString (d : date) : string =
  getNthString (#2 d - 1, months) ^ " " 
                                  ^ Int.toString(#1 d) 
                                  ^ ", " 
                                  ^ Int.toString(#3 d)

(******************************************************************************)

(****************************************************************************** 
  Задание 25 chineseYear
 ******************************************************************************)


(******************************************************************************)

(****************************************************************************** 
  Задание 26 dateToChineseYear
 ******************************************************************************)


(******************************************************************************)

(****************************************************************************** 
  Задание 27 dateToAnimal
 ******************************************************************************)


(******************************************************************************)

(****************************************************************************** 
  Задание 28 animal
 ******************************************************************************)


(******************************************************************************)

(****************************************************************************** 
  Задание 29 extractAnimal
 ******************************************************************************)


(******************************************************************************)

(****************************************************************************** 
  Задание 30 extractAnimals
 ******************************************************************************)


(******************************************************************************)

(****************************************************************************** 
  Задание 31 youngestFromAnimals
 ******************************************************************************)


(******************************************************************************)

(****************************************************************************** 
  Задание 32 oldStyleStudents
 ******************************************************************************)


(******************************************************************************)

(****************************************************************************** 
  Задание 33 youngestFromOldStyleAnimals
 ******************************************************************************)


(******************************************************************************)

(****************************************************************************** 
  Задание 34 listOfStringDates
 ******************************************************************************)


(******************************************************************************)

(****************************************************************************** 
  Задание 35 oldStyleStudentStringDates
 ******************************************************************************)


(******************************************************************************)

